//#include <iostream>
//using namespace std;
//
//void fun(int a = 12, char c = 'c')  //全部指定
//{
//	cout << a << " " << c << endl;
//}
//
//void fun1(int a , char c = 'c', float b = 12.22)  //部分指定  必须从右往左依次指定  连续
//{
//	cout << a << " " << b << " " << c << endl;
//}
//
//    //假如将函数定义放在主函数后面，则要把函数声明放在主函的前面，并且在声明后面加上分号，在函数定义后面不用加分号
//void fun2(int a=15, char d='d');   //在函数声明的地方已经对参数进行了赋值，就不用在后面的函数定义那里再进行赋值，否则就会重定义   
//								  //或则在声明和定义时都不对参数进行赋值，在主函数的调用时进行传递实参（赋值）
//int main()
//{
//	//函数调用时，如果有默认值的参数，可以不用传递实参,直接调用        
//	fun();
//
//	//没指定默认值的参数，一定要传递实参来调用
//	fun1(123);   //这里的123就是对fun1的int a进行传递实参 
//
//	//有默认值，再传递实参，将会覆盖默认值
//	fun(13 ,'b');  //也可以传一个
//
//	fun2( );
//
//	system("pause");
//	return 0;
//}
//void fun2(int a  , char c )  
//{
//	cout << a << " " << c << endl;
//}
